{
    "summary": "Principal-level software engineer and hands-on architect with 20+ years building scalable, secure and testable systems. I lead system design and technical decision-making, mentor engineers through pairing and feedback, and improve developer experience with strong CI/CD, observability and infrastructure-as-code. Fluent across backend, web and mobile, with deep experience in distributed systems, event-driven architectures and cloud deployments (AWS/Azure). Comfortable operating in regulated and fintech environments, balancing clean architecture with rapid, reliable delivery.",
    "skills": [
        "System architecture",
        "Distributed systems",
        "Event-driven microservices",
        "AWS",
        "Azure",
        "Kubernetes",
        "Terraform",
        "Docker",
        "CI/CD (GitHub Actions, ArgoCD)",
        "Go",
        "Rust",
        "C#",
        "SQL (PostgreSQL, SQL Server)",
        "NoSQL (DynamoDB, MongoDB)",
        "Contract testing (Pact)",
        "OpenTelemetry and observability"
    ],
    "work_experience": [
        {
            "job_title": "Technical Lead",
            "company": "dunnhumby (via Parser Digital)",
            "location": "London / Remote, UK",
            "start_date": "Apr 2024",
            "end_date": "Present",
            "company_blurb": "dunnhumby is a global leader in customer data science, empowering retailers and consumer brands to make customer-first decisions at scale, managing insight from 850 million active customers and analysing over $1.54 trillion in retail sales across more than 30 markets — emphasising data platforms and scalable engineering.",
            "responsibilities": [
                "Led system design and technical decisions for modular, event-driven services in Rust and .NET.",
                "Contributed production code across backend and platform while pairing with squads weekly.",
                "Standardised Terraform modules and CI/CD templates to uplift developer experience.",
                "Embedded contract testing and observability practices across services (Pact, OpenTelemetry).",
                "Introduced a micro-frontend architecture to decouple teams and enable independent delivery.",
                "Mentored engineers and facilitated architecture forums to align design and delivery."
            ],
            "achievements": [
                "Delivered a modular, event-driven backend aligned to clean architecture principles.",
                "Reduced cross-service integration bugs by 40% through contract-driven development.",
                "Enabled independent deploy pipelines via micro-frontend and platform patterns.",
                "Accelerated infrastructure delivery with reusable Terraform modules and template workflows."
            ]
        },
        {
            "job_title": "Lead Consultant",
            "company": "ThoughtWorks Ltd",
            "location": "London, UK",
            "start_date": "Feb 2015",
            "end_date": "Feb 2017",
            "company_blurb": "ThoughtWorks Ltd is the UK arm of Thoughtworks, a global technology consultancy known for pioneering agile, continuous delivery and the twice-yearly Technology Radar — strong engineering culture.",
            "responsibilities": [
                "Acted as technical delivery lead across multi-squad finance and insurance programmes.",
                "Designed a domain-specific language with underwriters and delivered a polyglot microservices platform.",
                "Established CI/CD pipelines and contract-testing strategies for safe, frequent releases.",
                "Mentored engineers via pairing, pattern libraries and sustainable refactoring practices.",
                "Coordinated architectural alignment with stakeholders to support long-term maintainability."
            ],
            "achievements": [
                "Shipped multiple products reliably using continuous delivery in regulated client contexts.",
                "Improved code quality and team autonomy through contract testing and shared patterns.",
                "Contributed to open-source work (D-CENT) and delivered a cross-platform mobile app."
            ]
        },
        {
            "job_title": "Senior Analyst Engineer",
            "company": "Credit Suisse",
            "location": "London, UK",
            "start_date": "Jul 2012",
            "end_date": "Mar 2013",
            "company_blurb": "Credit Suisse was a global investment bank and wealth manager headquartered in Zürich — investment banking domain.",
            "responsibilities": [
                "Engineered a low-latency pricing engine for complex derivatives and structured products.",
                "Built service abstraction layers (WCF, REST) to decouple front ends from multiple banking systems.",
                "Developed trading interfaces and supported migration from Silverlight toward modern web.",
                "Consolidated legacy platforms into a standardised .NET ecosystem to reduce complexity.",
                "Collaborated with analysts, UX and QA to align technical solutions with business needs."
            ],
            "achievements": [
                "Improved responsiveness and reliability of pricing and trading workflows in production.",
                "Reduced maintenance overhead via platform consolidation and modular service boundaries.",
                "Enabled broader device compatibility and maintainability through UI and API modernisation."
            ]
        }
    ],
    "early_career": [
        {
            "title": "Principal Software Engineer (Contract)",
            "company": "BrightInsight",
            "dates": "2020 – 2024"
        },
        {
            "title": "Technical Director",
            "company": "Baby Point App Ltd",
            "dates": "2019 – 2020"
        },
        {
            "title": "Principal Solution Architect (Contract)",
            "company": "Philips",
            "dates": "2019 – 2020"
        },
        {
            "title": "Principal Software Engineer (Contract)",
            "company": "Medisanté AG",
            "dates": "2017 – 2018"
        },
        {
            "title": "Lead Mobile Developer (Contract)",
            "company": "Investec Bank Plc",
            "dates": "2017"
        },
        {
            "title": "Mobile Tech Lead (Contract)",
            "company": "Ernst & Young (EY)",
            "dates": "2014 – 2015"
        },
        {
            "title": "Senior Engineer (Contract)",
            "company": "McKinsey Digital Labs",
            "dates": "2014"
        },
        {
            "title": "Lead Engineer / Architect (Contract)",
            "company": "Blackthorn Technologies",
            "dates": "2013 – 2014"
        },
        {
            "title": "Engineering Manager (Contract)",
            "company": "Miomni LTD",
            "dates": "2012"
        },
        {
            "title": "Senior Engineer (Contract)",
            "company": "Alpari UK",
            "dates": "2011 – 2012"
        },
        {
            "title": "Lead Engineer",
            "company": "Just Eat",
            "dates": "2011"
        },
        {
            "title": "AI Engineer (Contract)",
            "company": "Microsoft Research",
            "dates": "2011"
        },
        {
            "title": "Lead Software Engineer (Contract)",
            "company": "How Splendid Ltd",
            "dates": "2010 – 2011"
        },
        {
            "title": "Lead Software Engineer / Senior Engineer",
            "company": "Live Nation",
            "dates": "2008 – 2010"
        },
        {
            "title": "Senior Engineer / Junior Developer",
            "company": "DesignSquad.net",
            "dates": "2001 – 2008"
        }
    ]
}